{
  "descriptionSentences": [
    "I work on League of Legends!",
    "I create user experiences.",
    "I've worked at cool startups!",
    "If you're still reading...",
    "I guess I'll tell you more!",
    "I love making sushi.",
    "I'm really into music!",
    "I'm learning German!",
    "I've travelled to 24 countries!",
    "I'm 6'7\", but don't play basketball.",
    "And now, back to the start."
  ],
  "description": "I'm a software developer based in Los Angeles, California, currently working on the League of Legends Client at Riot Games!",
  "education": {
    "uoft": {
      "title": "HBSc. Computer Science",
      "subtitle": "University of Toronto",
      "description": "Honours specialist degree in Computer Science, and a minor in German!\n\nAwarded the Mary Victoria Court Scholarship, the J. A. Surerus Memorial Scholarship, and a four-time Dean's List Scholar."
    },
    "tli": {
      "title": "Technology Leadership Initiative",
      "subtitle": "University of Toronto",
      "description": "Selected for the Technology Leadership Initiative, a elite admission-based program, specializing in industry integrated learning, tailored leadership training, and valuable training from professionals.\n\n As part of the Initiative, I developed an MVP for the Global Payments division of Scotiabank, which you can demo "
    }
  },
  "experience": [
    {
      "company": "Riot Games",
      "role": "Software Developer",
      "description": "Developing the League of Legends client, used by more than a hundred million monthly users!\n\nIdentified and fixed memory leaks across the League of Legends client in EmberJS and C++, reducing long session memory use."
    },
    {
      "company": "Presize.ai",
      "role": "Front-end Developer",
      "description": "Overhauled the UX using Material UI, the ReactJS framework in TypeScript, and Redux Toolkit state management, to decrease drop-off rate.\n\nImplemented a guided, in-browser video scanning feature, decreasing user drop-off rate and increasing video input accuracy.\n\nImplemented a front-end behaviour tracking system in JS to decrease operating costs, optimize product team knowledge of application usage, and diagnose user journey choke points."
    },
    {
      "company": "Lady Ballers Camp",
      "role": "Software Engineer, Front-end Team Lead, and Product Manager",
      "description": "Created a mobile Expo React Native application centered around Content Delivery, and Twitter-esque social media interactions.\n\nUsed Sanity Studio to create a custom Content Management System (CMS) and Creation Platform, for platform independent content delivery. Deployed and wrote queries for both the GraphQL and GROQ API endpoints of Sanity Studio.\n\nBuilt a proprietary React Native component library for translating content data delivered from Sanity's API into natively rendered markdown.\n\nMentored three junior engineers in React fundamentals, the NativeBase and Material UI component libraries, and Redux state management."
    },
    {
      "company": "Scotiabank's Digital Factory",
      "role": "Software Developer",
      "description": "I was the only software developer intern brought into the Digital Factory during the summer of 2020.\n\nDeveloped new customer target filtering features to streamline the creation of targeted product campaigns and offers, using ReactJS and Redux.\n\nWon the bank wide Intern Capstone project, with an educational solution to increase customer acquisition across the bank, through a Figma prototype, which prioritized ROI and available tech assets."
    },
    {
      "company": "catchUp",
      "role": "Software Developer",
      "description": "Lead developer and designer in a start-up project, catchUp, a note sharing service that focuses on working with accessibility needs guidelines. Designed the application and flows using Figma. Developing the Front-end using technologies such as ReactJS, React Routing, to deliver a clean minimalist user experience."
    },
    {
      "company": "NexJ Health Inc.",
      "role": "Software Developer",
      "description": "Developed a web and native Android and iOS applications for NexJ Health Inc's patient-facing healthcare platform as a full stack developer.\n\nBuilt new user functionality and features, while working on the application's front-end UI through a custom in-house framework in JavaScript, creating back-end services with Node JS, and interacting with the MongoDB database under a Mongoose schema. Worked on the deployment of the web application into native applications through Adobe PhoneGap."
    }
  ],
  "projects": [
    {
      "name": "Scotiabank MVP Web Application",
      "collab": "Technology Leaderhip Initiatve x Scotiabank Collaboration",
      "description": "Developed a reactive prototype for Scotiabank's Global Payments division, mocking Interac's Request to Pay feature for businesses, to reduce fees/overhead costs for immediate ROI.\n\nDeveloped a customer and internal facing application with ReactJS, for which I created REST APIs for back-end services with ExpressJS in TypeScript."
    },
    {
      "name": "This Website!",
      "collab": "Stand alone project",
      "description": "Created this website from the ground up, using technologies such as React, React Router, all of the latest React Hooks, entirely custom CSS, and Firebase for the back-end."
    }
  ]
}