{
  "descriptionSentences": [
    "I work on League of Legends!",
    "I've worked at cool startups!",
    "I've been learning German!",
    "I've travelled to 24 countries!",
    "I'm 6'7\", but don't play basketball."
  ],
  "description": "I'm a software developer based in Los Angeles, California, currently working on the League of Legends Client at Riot Games!",
  "education": [
    {
      "title": "HBSc. Computer Science",
      "subtitle": "University of Toronto",
      "description": "Honours Bachelors of Science in Computer Science, Specialist Degree, and a minor in German.\n\nAwarded the Mary Victoria Court Scholarship, the J. A. Surerus Memorial Scholarship, and a four-time Dean's List Scholar."
    },
    {
      "title": "Technology Leadership Initiative",
      "subtitle": "University of Toronto",
      "description": "Selected for the Technology Leadership Initiative, a elite admission-based program, specializing in industry integrated learning, tailored leadership training, and valuable training from professionals.\n\nAs part of the Initiative, I developed an MVP for the Global Payments division of Scotiabank, which you can demo "
    }
  ],
  "experience": [
    {
      "company": "Riot Games",
      "role": "Software Engineer",
      "description": "Developing the League of Legends Client, an application built on CEF (Chromium Embedded Framework), Ember.js, and a C++ backend. This Client is used by more than a hundred million monthly users!\n\nI've been implementing end-to-end player-facing, internal, and tooling features. Proactively mitigating issues in live through the development of unit test suites using Sinon and Chai. I pride myself and thorough feature developer documentation.\n\nLeading development of upcoming player-facing feature as technical point of contact and tech lead.\n\nHeaded reduction in memory usage and technical debt through extensive refactoring of Web Components into Ember.js components.\n\nLaunched features for transitioning players in our Southeast Asian regions away from a third party publisher to self-published Riot Regions, for which I served as technical point of contact.\n\nSuccessfully released patch 13.7 of the League of Legends Client as Release Captain.\n\nActively managed and resolved live incidents for the League of Legends Client during 24/7 on-call rotations."
    },
    {
      "company": "Riot Games",
      "role": "Software Engineering Intern",
      "description": "Decreased long session memory usage by >5MBs in the Client, by identifying 19 leaks and creating Ember.js component wrappers to plug them.\n\nIdentified source of broken callbacks between nested Ember.js applications through a deep dive into unique interactions in the Ember engine."
    },
    {
      "company": "Presize.ai",
      "role": "Front-end Developer",
      "description": "Decreased user drop-off rate and increased video input accuracy by implementing a guided, mobile in-browser video scanning feature.\n\nIncreased user flow completion rate through an extensive overhaul of the UX using React.js in TypeScript, Material UI, and Redux Toolkit.\n\nSignificantly lowered costs of obtaining tracking metrics, informed product team's knowledge of app usage, and diagnosed user journey choke points by implementing a front-end user behaviour tracking system in JavaScript."
    },
    {
      "company": "Lady Ballers Camp",
      "role": "Software Engineer, Front-end Team Lead, and Product Manager",
      "description": "Created a mobile Expo React Native application centered around Content Delivery, and Twitter-esque social media interactions.\n\nUsed Sanity Studio to create a custom Content Management System (CMS) and Creation Platform, for platform independent content delivery. Deployed and wrote queries for both the GraphQL and GROQ API endpoints of Sanity Studio.\n\nBuilt a proprietary React Native component library for translating content data delivered from Sanity's API into natively rendered markdown.\n\nMentored three junior engineers in React fundamentals, the NativeBase and Material UI component libraries, and Redux state management."
    },
    {
      "company": "Scotiabank's Digital Factory",
      "role": "Software Developer",
      "description": "I was the only software developer intern brought into the Digital Factory during the summer of 2020.\n\nDeveloped new customer target filtering features to streamline the creation of targeted product campaigns and offers, using React.js and Redux.\n\nWon the bank wide Intern Capstone project, with an educational solution to increase customer acquisition across the bank, through a Figma prototype, which prioritized ROI and available tech assets."
    },
    {
      "company": "catchUp",
      "role": "Software Developer",
      "description": "Lead developer and designer in a start-up project, catchUp, a note sharing service that focuses on working with accessibility needs guidelines. Designed the application and flows using Figma. Developing the Front-end using technologies such as React.js, React Routing, to deliver a clean minimalist user experience."
    },
    {
      "company": "NexJ Health Inc.",
      "role": "Software Developer",
      "description": "Developed a web and native Android and iOS applications for NexJ Health Inc's patient-facing healthcare platform as a full stack developer.\n\nBuilt new user functionality and features, while working on the application's front-end UI through a custom in-house framework in JavaScript, creating back-end services with Node.js, and interacting with the MongoDB database under a Mongoose schema. Worked on the deployment of the web application into native applications through Adobe PhoneGap."
    }
  ],
  "projects": {
    "scotiabank": {
      "name": "Scotiabank MVP Web Application",
      "collab": "Technology Leadership Initiative x Scotiabank Collaboration",
      "description": "Developed a reactive prototype for Scotiabank's Global Payments division, mocking Interac's Request to Pay feature for businesses, to reduce fees/overhead costs for immediate ROI.\n\nDeveloped a customer and internal facing application with React.js, for which I created REST APIs for back-end services with Express.js in TypeScript."
    },
    "personalWebsite": {
      "name": "This Website!",
      "collab": "Stand alone project",
      "description": "Created this website from the ground up, using technologies such as React, React Router, all of the latest React Hooks, entirely custom CSS, and Firebase for the back-end."
    }
  }
}
